cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

brew "git"
brew "memcached"
brew "mysql"
brew "nginx"
brew "openssl"
brew "python"
brew "pyenv"
brew "rbenv"
brew "ruby-build"
brew "sqlite"
brew "telnet"
brew "tig"
brew "wget"
brew "vim"
brew "peco"
brew "jq"
brew "tmux"
brew "goenv"
brew "zsh"
brew "exa"
brew "llvm"
brew "clang-format"
brew "gcc"
brew "fzf"
brew "lsd"
brew "ghq"
brew "nodebrew"
brew "awscli"
brew "bat"
brew "ripgrep"

cask "alfred"
cask "iterm2"
cask "java"
cask "google-japanese-ime"
cask "google-chrome"
cask "slack"
cask "spotify"
cask "mysqlworkbench"
cask "visual-studio-code"
cask "notion"
cask "postman"
cask "virtualbox"
cask "vagrant"

cask "docker"
brew "docker-compose"

# mas "Xcode", id: 497799835
